Revit 2027 API
STLExportOptions.IsValidForGridAspectRatio Method
 Checks whether the value is allowed (is in the allowed range) for GridAspectRatio tessellation parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidForGridAspectRatio(
	double value
)
Public Shared Function IsValidForGridAspectRatio (
	value As Double
) As Boolean
public:
static bool IsValidForGridAspectRatio(
	double value
)
static member IsValidForGridAspectRatio :
        value : float -> bool
Parameters
value Double
 The value to be checked.
Return Value
Boolean
 True if the value is valid for GridAspectRatio, false otherwise.
See Also
Reference
STLExportOptions Class
Autodesk.Revit.DB Namespace